In [1]:
import pandas as pd

In [2]:
# Lendo arquivo excel
dfClientes   = pd.read_excel('caso_estudo.xlsx', sheet_name = 'clientes')
dfLojas      = pd.read_excel('caso_estudo.xlsx', sheet_name = 'lojas')
dfProdutos   = pd.read_excel('caso_estudo.xlsx', sheet_name = 'produtos')
dfVendas     = pd.read_excel('caso_estudo.xlsx', sheet_name = 'vendas')
dfPagamentos = pd.read_excel('caso_estudo.xlsx', sheet_name = 'pagamentos')

In [3]:
# Verificando se existe algum registro (nome) duplicado
dfClientes.nome.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996     True
997    False
998    False
999     True
Name: nome, Length: 1000, dtype: bool

In [4]:
# Verificando se existe algum registro (nome) duplicado
# Aplicando uma soma
dfClientes.nome.duplicated().sum()
# 109 nomes duplicado

109

In [5]:
# Verificando se esses nomes duplicado são realmente dados duplicados
# Avaliar os dados duplicados
dfClientes[ dfClientes.nome.duplicated() ]

       id                nome sexo     dt_nasc
79     80           Anna Melo    F   8/10/1999
96     97  Beatrice Goncalves    F  11/22/1964
138   139         Kauê Araujo    M   5/31/1974
139   140        Leonor Sousa    F    8/2/1981
154   155      Luis Rodrigues    M    7/3/1973
..    ...                 ...  ...         ...
986   987     Beatriz Cardoso    F   7/17/1984
990   991          Diogo Melo    M   7/24/2001
993   994       Eduardo Costa    M  12/18/1963
996   997      Laura Oliveira    F   6/15/1979
999  1000     Gustavo Barbosa    M  12/30/1975

[109 rows x 4 columns]

In [6]:
# Vamos ver o nome: Anna Melo
dfClientes[ dfClientes.nome == 'Anna Melo' ]
# Pela data de nascimento percebesse que são pessoas distintas

    id       nome sexo    dt_nasc
66  67  Anna Melo    F  11/6/1995
79  80  Anna Melo    F  8/10/1999

In [7]:
# Verificando se todo data Frame se tem algum registos distintos
# tem que verificar se tem alguma linha que se repete.
# E tem que aplicar uma soma nesse registro.
dfClientes.duplicated().sum()

0

#### Tome cuidado porque temos id diferentes, mas representando a mesma pessoa

In [8]:
# Verificando se todo data Frame se tem algum registos distintos
# tem que verificar se tem alguma linha que se repete.
# E tem que aplicar uma soma nesse registro.
# ---
# Eliminado a coluna id
# drop() -> retirar uma coluna ou linha e () coloca qual é a coluna/linha.
# Só que tem que referenciar o eixo dessa coluna
# axis = 0 -> se for 0 representa linha
# axis = 1 -> se for 1 representa coluna
dfClientes.drop('id', axis = 1).duplicated().sum()

0

In [9]:
dfVendas.drop('id', axis = 1).duplicated().sum()

1

In [10]:
# Está avaliando se existe algum nome de produto duplicado dentro do data frame produtos
dfProdutos.produto.duplicated().sum()

0

In [11]:
# Está avaliando se existe algum nome de loja duplicado dentro do data frame lojas
dfLojas.cidade.duplicated().sum()

0

In [12]:
# verificando se apresenta dados de vendas
dfVendas.drop('id', axis = 1).duplicated().sum()

1

In [13]:
# Verificando esse dado dupliccado
# Está analizando o data frame vendas, aplicando filtro entre cocheite para os dados duplicados 
dfVendas[ dfVendas.drop('id', axis = 1).duplicated() ]

      id  id_cliente  id_loja  id_produto   dt_venda
496  497         559        2           5 2018-06-22

In [14]:
# analisando esse dado repetindo.
dfVendas[ (dfVendas.id_cliente == 559) & (dfVendas.id_loja == 2) & (dfVendas.id_produto == 5) ]

      id  id_cliente  id_loja  id_produto   dt_venda
495  496         559        2           5 2018-06-22
496  497         559        2           5 2018-06-22

In [15]:
dfPagamentos.drop('id', axis = 1).duplicated().sum()

0